{
    "id":"391ca552-6cdc-4d48-8e3d-97a319549bf1",
    "comment":"Test for dwarf over evaluation",
    "dataset":"./dataset/fantasyRace",
    "labels":[
        "dwarf",
        "elf",
        "human",
        "orc"
    ],
    "valid_score":{
        "error_rate":0.4832992501704158,
        "categorical":{
            "dwarf":0.5331465919701214,
            "elf":0.5147198480531814,
            "human":0.6061507936507937,
            "orc":0.31757289204097716
        }
    },
    "train_score":{
        "error_rate":0.7491479209270621,
        "categorical":{
            "dwarf":0.7546666666666667,
            "elf":0.7543133195307108,
            "human":0.7930015905476029,
            "orc":0.6939853076216713
        }
    },
    "epoch_number":2,
    "augmentation_cycle":8,
    "augmentation_layers":[
        {
            "name":"random_flip",
            "trainable":true,
            "dtype":"float32",
            "mode":"horizontal",
            "seed":null
        },
        {
            "name":"random_rotation",
            "trainable":true,
            "dtype":"float32",
            "factor":0.1,
            "fill_mode":"reflect",
            "fill_value":0.0,
            "interpolation":"bilinear",
            "seed":null
        },
        {
            "name":"random_zoom",
            "trainable":true,
            "dtype":"float32",
            "height_factor":0.1,
            "width_factor":null,
            "fill_mode":"reflect",
            "fill_value":0.0,
            "interpolation":"bilinear",
            "seed":null
        },
        {
            "name":"random_translation",
            "trainable":true,
            "dtype":"float32",
            "height_factor":0.1,
            "width_factor":0.1,
            "fill_mode":"reflect",
            "fill_value":0.0,
            "interpolation":"bilinear",
            "seed":null
        },
        {
            "name":"random_contrast",
            "trainable":true,
            "dtype":"float32",
            "factor":0.1,
            "seed":null
        },
        {
            "name":"random_brightness",
            "trainable":true,
            "dtype":"float32",
            "factor":[
                -0.1,
                0.1
            ],
            "value_range":[
                0,
                255
            ],
            "seed":null
        },
        {
            "name":"square_image_layer",
            "trainable":true,
            "dtype":"float32"
        }
    ],
    "model":{
        "class_name":"Sequential",
        "config":{
            "name":"sequential",
            "layers":[
                {
                    "module":"keras.layers",
                    "class_name":"InputLayer",
                    "config":{
                        "batch_input_shape":[
                            null,
                            128,
                            128,
                            3
                        ],
                        "dtype":"float32",
                        "sparse":false,
                        "ragged":false,
                        "name":"rescaling_input"
                    },
                    "registered_name":null
                },
                {
                    "module":"keras.layers",
                    "class_name":"Rescaling",
                    "config":{
                        "name":"rescaling",
                        "trainable":true,
                        "dtype":"float32",
                        "scale":0.00392156862745098,
                        "offset":0.0
                    },
                    "registered_name":null,
                    "build_config":{
                        "input_shape":[
                            null,
                            128,
                            128,
                            3
                        ]
                    }
                },
                {
                    "module":"keras.layers",
                    "class_name":"Conv2D",
                    "config":{
                        "name":"conv2d",
                        "trainable":true,
                        "dtype":"float32",
                        "filters":32,
                        "kernel_size":[
                            3,
                            3
                        ],
                        "strides":[
                            1,
                            1
                        ],
                        "padding":"same",
                        "data_format":"channels_last",
                        "dilation_rate":[
                            1,
                            1
                        ],
                        "groups":1,
                        "activation":"relu",
                        "use_bias":true,
                        "kernel_initializer":{
                            "module":"keras.initializers",
                            "class_name":"GlorotUniform",
                            "config":{
                                "seed":null
                            },
                            "registered_name":null
                        },
                        "bias_initializer":{
                            "module":"keras.initializers",
                            "class_name":"Zeros",
                            "config":{},
                            "registered_name":null
                        },
                        "kernel_regularizer":null,
                        "bias_regularizer":null,
                        "activity_regularizer":null,
                        "kernel_constraint":null,
                        "bias_constraint":null
                    },
                    "registered_name":null,
                    "build_config":{
                        "input_shape":[
                            null,
                            128,
                            128,
                            3
                        ]
                    }
                },
                {
                    "module":"keras.layers",
                    "class_name":"MaxPooling2D",
                    "config":{
                        "name":"max_pooling2d",
                        "trainable":true,
                        "dtype":"float32",
                        "pool_size":[
                            2,
                            2
                        ],
                        "padding":"valid",
                        "strides":[
                            2,
                            2
                        ],
                        "data_format":"channels_last"
                    },
                    "registered_name":null,
                    "build_config":{
                        "input_shape":[
                            null,
                            128,
                            128,
                            32
                        ]
                    }
                },
                {
                    "module":"keras.layers",
                    "class_name":"Conv2D",
                    "config":{
                        "name":"conv2d_1",
                        "trainable":true,
                        "dtype":"float32",
                        "filters":64,
                        "kernel_size":[
                            3,
                            3
                        ],
                        "strides":[
                            1,
                            1
                        ],
                        "padding":"same",
                        "data_format":"channels_last",
                        "dilation_rate":[
                            1,
                            1
                        ],
                        "groups":1,
                        "activation":"relu",
                        "use_bias":true,
                        "kernel_initializer":{
                            "module":"keras.initializers",
                            "class_name":"GlorotUniform",
                            "config":{
                                "seed":null
                            },
                            "registered_name":null
                        },
                        "bias_initializer":{
                            "module":"keras.initializers",
                            "class_name":"Zeros",
                            "config":{},
                            "registered_name":null
                        },
                        "kernel_regularizer":null,
                        "bias_regularizer":null,
                        "activity_regularizer":null,
                        "kernel_constraint":null,
                        "bias_constraint":null
                    },
                    "registered_name":null,
                    "build_config":{
                        "input_shape":[
                            null,
                            64,
                            64,
                            32
                        ]
                    }
                },
                {
                    "module":"keras.layers",
                    "class_name":"MaxPooling2D",
                    "config":{
                        "name":"max_pooling2d_1",
                        "trainable":true,
                        "dtype":"float32",
                        "pool_size":[
                            2,
                            2
                        ],
                        "padding":"valid",
                        "strides":[
                            2,
                            2
                        ],
                        "data_format":"channels_last"
                    },
                    "registered_name":null,
                    "build_config":{
                        "input_shape":[
                            null,
                            64,
                            64,
                            64
                        ]
                    }
                },
                {
                    "module":"keras.layers",
                    "class_name":"Conv2D",
                    "config":{
                        "name":"conv2d_2",
                        "trainable":true,
                        "dtype":"float32",
                        "filters":128,
                        "kernel_size":[
                            3,
                            3
                        ],
                        "strides":[
                            1,
                            1
                        ],
                        "padding":"same",
                        "data_format":"channels_last",
                        "dilation_rate":[
                            1,
                            1
                        ],
                        "groups":1,
                        "activation":"relu",
                        "use_bias":true,
                        "kernel_initializer":{
                            "module":"keras.initializers",
                            "class_name":"GlorotUniform",
                            "config":{
                                "seed":null
                            },
                            "registered_name":null
                        },
                        "bias_initializer":{
                            "module":"keras.initializers",
                            "class_name":"Zeros",
                            "config":{},
                            "registered_name":null
                        },
                        "kernel_regularizer":null,
                        "bias_regularizer":null,
                        "activity_regularizer":null,
                        "kernel_constraint":null,
                        "bias_constraint":null
                    },
                    "registered_name":null,
                    "build_config":{
                        "input_shape":[
                            null,
                            32,
                            32,
                            64
                        ]
                    }
                },
                {
                    "module":"keras.layers",
                    "class_name":"MaxPooling2D",
                    "config":{
                        "name":"max_pooling2d_2",
                        "trainable":true,
                        "dtype":"float32",
                        "pool_size":[
                            2,
                            2
                        ],
                        "padding":"valid",
                        "strides":[
                            2,
                            2
                        ],
                        "data_format":"channels_last"
                    },
                    "registered_name":null,
                    "build_config":{
                        "input_shape":[
                            null,
                            32,
                            32,
                            128
                        ]
                    }
                },
                {
                    "module":"keras.layers",
                    "class_name":"Flatten",
                    "config":{
                        "name":"flatten",
                        "trainable":true,
                        "dtype":"float32",
                        "data_format":"channels_last"
                    },
                    "registered_name":null,
                    "build_config":{
                        "input_shape":[
                            null,
                            16,
                            16,
                            128
                        ]
                    }
                },
                {
                    "module":"keras.layers",
                    "class_name":"Dense",
                    "config":{
                        "name":"dense",
                        "trainable":true,
                        "dtype":"float32",
                        "units":128,
                        "activation":"relu",
                        "use_bias":true,
                        "kernel_initializer":{
                            "module":"keras.initializers",
                            "class_name":"GlorotUniform",
                            "config":{
                                "seed":null
                            },
                            "registered_name":null
                        },
                        "bias_initializer":{
                            "module":"keras.initializers",
                            "class_name":"Zeros",
                            "config":{},
                            "registered_name":null
                        },
                        "kernel_regularizer":null,
                        "bias_regularizer":null,
                        "activity_regularizer":null,
                        "kernel_constraint":null,
                        "bias_constraint":null
                    },
                    "registered_name":null,
                    "build_config":{
                        "input_shape":[
                            null,
                            32768
                        ]
                    }
                },
                {
                    "module":"keras.layers",
                    "class_name":"Dropout",
                    "config":{
                        "name":"dropout",
                        "trainable":true,
                        "dtype":"float32",
                        "rate":0.2,
                        "noise_shape":null,
                        "seed":null
                    },
                    "registered_name":null,
                    "build_config":{
                        "input_shape":[
                            null,
                            128
                        ]
                    }
                },
                {
                    "module":"keras.layers",
                    "class_name":"Dense",
                    "config":{
                        "name":"dense_1",
                        "trainable":true,
                        "dtype":"float32",
                        "units":4,
                        "activation":"softmax",
                        "use_bias":true,
                        "kernel_initializer":{
                            "module":"keras.initializers",
                            "class_name":"GlorotUniform",
                            "config":{
                                "seed":null
                            },
                            "registered_name":null
                        },
                        "bias_initializer":{
                            "module":"keras.initializers",
                            "class_name":"Zeros",
                            "config":{},
                            "registered_name":null
                        },
                        "kernel_regularizer":null,
                        "bias_regularizer":null,
                        "activity_regularizer":null,
                        "kernel_constraint":null,
                        "bias_constraint":null
                    },
                    "registered_name":null,
                    "build_config":{
                        "input_shape":[
                            null,
                            128
                        ]
                    }
                }
            ]
        },
        "keras_version":"2.15.0",
        "backend":"tensorflow"
    },
    "weights":"saves/2024-03-09/weights/save_model_18-47-55__391ca552-6cdc-4d48-8e3d-97a319549bf1.h5"
}