{
    "augmentation_cycle": 8,
    "augmentation_layers":[
        {
            "dtype":"float32",
            "mode":"horizontal",
            "name":"random_flip",
            "seed":null,
            "trainable":true
        },
        {
            "dtype":"float32",
            "factor":0.1,
            "fill_mode":"reflect",
            "fill_value":0.0,
            "interpolation":"bilinear",
            "name":"random_rotation",
            "seed":null,
            "trainable":true
        },
        {
            "dtype":"float32",
            "fill_mode":"reflect",
            "fill_value":0.0,
            "height_factor":0.1,
            "interpolation":"bilinear",
            "name":"random_zoom",
            "seed":null,
            "trainable":true,
            "width_factor":null
        },
        {
            "dtype":"float32",
            "fill_mode":"reflect",
            "fill_value":0.0,
            "height_factor":0.1,
            "interpolation":"bilinear",
            "name":"random_translation",
            "seed":null,
            "trainable":true,
            "width_factor":0.1
        },
        {
            "dtype":"float32",
            "factor":0.1,
            "name":"random_contrast",
            "seed":null,
            "trainable":true
        },
        {
            "dtype":"float32",
            "factor":[
                -0.1,
                0.1
            ],
            "name":"random_brightness",
            "seed":null,
            "trainable":true,
            "value_range":[
                0,
                255
            ]
        }
    ],
    "dataset":"./dataset/fantasyRace",
    "epoch_number":10,
    "labels":[
        "dwarf",
        "elf",
        "human",
        "orc"
    ],
    "model":{
        "backend":"tensorflow",
        "class_name":"Sequential",
        "config":{
            "layers":[
                {
                    "class_name":"InputLayer",
                    "config":{
                        "batch_input_shape":[
                            null,
                            64,
                            64,
                            3
                        ],
                        "dtype":"float32",
                        "name":"rescaling_input",
                        "ragged":false,
                        "sparse":false
                    },
                    "module":"keras.layers",
                    "registered_name":null
                },
                {
                    "build_config":{
                        "input_shape":[
                            null,
                            64,
                            64,
                            3
                        ]
                    },
                    "class_name":"Rescaling",
                    "config":{
                        "dtype":"float32",
                        "name":"rescaling",
                        "offset":0.0,
                        "scale":0.00392156862745098,
                        "trainable":true
                    },
                    "module":"keras.layers",
                    "registered_name":null
                },
                {
                    "build_config":{
                        "input_shape":[
                            null,
                            64,
                            64,
                            3
                        ]
                    },
                    "class_name":"Conv2D",
                    "config":{
                        "activation":"relu",
                        "activity_regularizer":null,
                        "bias_constraint":null,
                        "bias_initializer":{
                            "class_name":"Zeros",
                            "config":{},
                            "module":"keras.initializers",
                            "registered_name":null
                        },
                        "bias_regularizer":null,
                        "data_format":"channels_last",
                        "dilation_rate":[
                            1,
                            1
                        ],
                        "dtype":"float32",
                        "filters":32,
                        "groups":1,
                        "kernel_constraint":null,
                        "kernel_initializer":{
                            "class_name":"GlorotUniform",
                            "config":{
                                "seed":null
                            },
                            "module":"keras.initializers",
                            "registered_name":null
                        },
                        "kernel_regularizer":null,
                        "kernel_size":[
                            3,
                            3
                        ],
                        "name":"conv2d",
                        "padding":"same",
                        "strides":[
                            1,
                            1
                        ],
                        "trainable":true,
                        "use_bias":true
                    },
                    "module":"keras.layers",
                    "registered_name":null
                },
                {
                    "build_config":{
                        "input_shape":[
                            null,
                            64,
                            64,
                            32
                        ]
                    },
                    "class_name":"MaxPooling2D",
                    "config":{
                        "data_format":"channels_last",
                        "dtype":"float32",
                        "name":"max_pooling2d",
                        "padding":"valid",
                        "pool_size":[
                            2,
                            2
                        ],
                        "strides":[
                            2,
                            2
                        ],
                        "trainable":true
                    },
                    "module":"keras.layers",
                    "registered_name":null
                },
                {
                    "build_config":{
                        "input_shape":[
                            null,
                            32,
                            32,
                            32
                        ]
                    },
                    "class_name":"Conv2D",
                    "config":{
                        "activation":"relu",
                        "activity_regularizer":null,
                        "bias_constraint":null,
                        "bias_initializer":{
                            "class_name":"Zeros",
                            "config":{},
                            "module":"keras.initializers",
                            "registered_name":null
                        },
                        "bias_regularizer":null,
                        "data_format":"channels_last",
                        "dilation_rate":[
                            1,
                            1
                        ],
                        "dtype":"float32",
                        "filters":64,
                        "groups":1,
                        "kernel_constraint":null,
                        "kernel_initializer":{
                            "class_name":"GlorotUniform",
                            "config":{
                                "seed":null
                            },
                            "module":"keras.initializers",
                            "registered_name":null
                        },
                        "kernel_regularizer":null,
                        "kernel_size":[
                            3,
                            3
                        ],
                        "name":"conv2d_1",
                        "padding":"same",
                        "strides":[
                            1,
                            1
                        ],
                        "trainable":true,
                        "use_bias":true
                    },
                    "module":"keras.layers",
                    "registered_name":null
                },
                {
                    "build_config":{
                        "input_shape":[
                            null,
                            32,
                            32,
                            64
                        ]
                    },
                    "class_name":"MaxPooling2D",
                    "config":{
                        "data_format":"channels_last",
                        "dtype":"float32",
                        "name":"max_pooling2d_1",
                        "padding":"valid",
                        "pool_size":[
                            2,
                            2
                        ],
                        "strides":[
                            2,
                            2
                        ],
                        "trainable":true
                    },
                    "module":"keras.layers",
                    "registered_name":null
                },
                {
                    "build_config":{
                        "input_shape":[
                            null,
                            16,
                            16,
                            64
                        ]
                    },
                    "class_name":"Conv2D",
                    "config":{
                        "activation":"relu",
                        "activity_regularizer":null,
                        "bias_constraint":null,
                        "bias_initializer":{
                            "class_name":"Zeros",
                            "config":{},
                            "module":"keras.initializers",
                            "registered_name":null
                        },
                        "bias_regularizer":null,
                        "data_format":"channels_last",
                        "dilation_rate":[
                            1,
                            1
                        ],
                        "dtype":"float32",
                        "filters":128,
                        "groups":1,
                        "kernel_constraint":null,
                        "kernel_initializer":{
                            "class_name":"GlorotUniform",
                            "config":{
                                "seed":null
                            },
                            "module":"keras.initializers",
                            "registered_name":null
                        },
                        "kernel_regularizer":null,
                        "kernel_size":[
                            3,
                            3
                        ],
                        "name":"conv2d_2",
                        "padding":"same",
                        "strides":[
                            1,
                            1
                        ],
                        "trainable":true,
                        "use_bias":true
                    },
                    "module":"keras.layers",
                    "registered_name":null
                },
                {
                    "build_config":{
                        "input_shape":[
                            null,
                            16,
                            16,
                            128
                        ]
                    },
                    "class_name":"MaxPooling2D",
                    "config":{
                        "data_format":"channels_last",
                        "dtype":"float32",
                        "name":"max_pooling2d_2",
                        "padding":"valid",
                        "pool_size":[
                            2,
                            2
                        ],
                        "strides":[
                            2,
                            2
                        ],
                        "trainable":true
                    },
                    "module":"keras.layers",
                    "registered_name":null
                },
                {
                    "build_config":{
                        "input_shape":[
                            null,
                            8,
                            8,
                            128
                        ]
                    },
                    "class_name":"Flatten",
                    "config":{
                        "data_format":"channels_last",
                        "dtype":"float32",
                        "name":"flatten",
                        "trainable":true
                    },
                    "module":"keras.layers",
                    "registered_name":null
                },
                {
                    "build_config":{
                        "input_shape":[
                            null,
                            8192
                        ]
                    },
                    "class_name":"Dense",
                    "config":{
                        "activation":"relu",
                        "activity_regularizer":null,
                        "bias_constraint":null,
                        "bias_initializer":{
                            "class_name":"Zeros",
                            "config":{},
                            "module":"keras.initializers",
                            "registered_name":null
                        },
                        "bias_regularizer":null,
                        "dtype":"float32",
                        "kernel_constraint":null,
                        "kernel_initializer":{
                            "class_name":"GlorotUniform",
                            "config":{
                                "seed":null
                            },
                            "module":"keras.initializers",
                            "registered_name":null
                        },
                        "kernel_regularizer":null,
                        "name":"dense",
                        "trainable":true,
                        "units":128,
                        "use_bias":true
                    },
                    "module":"keras.layers",
                    "registered_name":null
                },
                {
                    "build_config":{
                        "input_shape":[
                            null,
                            128
                        ]
                    },
                    "class_name":"Dropout",
                    "config":{
                        "dtype":"float32",
                        "name":"dropout",
                        "noise_shape":null,
                        "rate":0.2,
                        "seed":null,
                        "trainable":true
                    },
                    "module":"keras.layers",
                    "registered_name":null
                },
                {
                    "build_config":{
                        "input_shape":[
                            null,
                            128
                        ]
                    },
                    "class_name":"Dense",
                    "config":{
                        "activation":"softmax",
                        "activity_regularizer":null,
                        "bias_constraint":null,
                        "bias_initializer":{
                            "class_name":"Zeros",
                            "config":{},
                            "module":"keras.initializers",
                            "registered_name":null
                        },
                        "bias_regularizer":null,
                        "dtype":"float32",
                        "kernel_constraint":null,
                        "kernel_initializer":{
                            "class_name":"GlorotUniform",
                            "config":{
                                "seed":null
                            },
                            "module":"keras.initializers",
                            "registered_name":null
                        },
                        "kernel_regularizer":null,
                        "name":"dense_1",
                        "trainable":true,
                        "units":4,
                        "use_bias":true
                    },
                    "module":"keras.layers",
                    "registered_name":null
                }
            ],
            "name":"sequential"
        },
        "keras_version":"2.15.0"
    },
    "train_score":{
        "accuracy":0.8949670791625977,
        "lost":0.29877355694770813
    },
    "valid_score":{
        "accuracy":0.7241535782814026,
        "lost":0.7620423436164856
    }
}